{
  "backend/main.mo": "Defines core backend data types and maps, handles user profiles, habit library, activity entries, pattern storage, programs, and enforces access control and blob storage integration.",
  "backend/migration.mo": "Provides a simple migration module that returns old state unchanged.",
  "feature_evidence.json": "Lists feature evidence reports mapping feature IDs to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files for build or documentation reference.",
  "frontend/index.css": "Sets up Tailwind CSS base layers and defines extensive light/dark theme CSS variables for the app.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/analysis/dashboardInsights.ts": "Implements heuristic calculations for emotional trends, spending triggers, time-of-day distribution, and insight signatures from patterns and activity entries.",
  "frontend/src/analysis/detectPatterns.ts": "Implements keyword‑based pattern detection on text, computing confidences and extracting snippets for several behavior categories.",
  "frontend/src/analysis/patternTypes.ts": "Defines pattern type constants with ids, titles, and descriptions used in analysis.",
  "frontend/src/App.tsx": "Main React app handling authentication, routing between views, onboarding, profile setup, and layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity, handling auth state and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Displays a modal for entering and saving a user’s name during profile setup.",
  "frontend/src/components/common/AccessDeniedScreen.tsx": "Shows an access‑denied screen prompting the user to sign in.",
  "frontend/src/components/entries/AddEntryView.tsx": "Provides a form to create a new activity entry with text, source, notes, and optional image upload.",
  "frontend/src/components/entries/EntriesListView.tsx": "Lists activity entries with previews and allows navigating to entry details or adding a new entry.",
  "frontend/src/components/entries/EntryDetailView.tsx": "Shows full details of a selected entry, including text, image attachments, and an option to run analysis.",
  "frontend/src/components/habits/HabitLibraryView.tsx": "Displays the habit library grouped by category, seeding defaults if empty and rendering each habit with details.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with header, navigation, content area, and footer, handling view navigation.",
  "frontend/src/components/onboarding/OnboardingDialog.tsx": "Shows a modal onboarding guide explaining how to add data, discover patterns, and start the program.",
  "frontend/src/components/patterns/insights/EmotionalTrendsSection.tsx": "Displays emotional trend percentages or a placeholder when insufficient data is available.",
  "frontend/src/components/patterns/insights/MorningNightDistributionSection.tsx": "Displays time‑of‑day activity distribution with percentages, bars, and peak period insights, with fallback when no data exists.",
  "frontend/src/components/patterns/insights/SpendingTriggersSection.tsx": "Shows counts, averages, trends, and peak days for spending triggers, including warnings when triggers are high.",
  "frontend/src/components/patterns/PatternsDashboardView.tsx": "Fetches patterns and entries, computes insights, and renders the pattern dashboard with metrics and trend sections.",
  "frontend/src/components/patterns/RunAnalysisButton.tsx": "Runs pattern detection on entry text, saves detected patterns, and shows loading and toast feedback.",
  "frontend/src/components/program/ProgramDayDetail.tsx": "Renders detailed info for a specific program day, including task details, rationale, reflection, and user check‑ins.",
  "frontend/src/components/program/ProgramView.tsx": "Manages program display, auto‑updates based on insight changes, allows generating a new program, and shows day details.",
  "frontend/src/components/today/ProgressSummary.tsx": "Summarizes user progress with completed days, streak, and average mood across program check‑ins.",
  "frontend/src/components/today/TodayCheckInView.tsx": "Provides daily check‑in form, loads existing check‑ins, handles submission, and shows state when no program exists.",
  "frontend/src/data/habitLibrary.ts": "Exports a predefined array of Habit objects grouped by categories such as Digital Balance and Spending Awareness.",
  "frontend/src/hooks/useActor.ts": "Defines a hook that creates and manages a backend actor tied to the user's Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a context and hooks for managing Internet Identity authentication, including login state, stored identities, and lifecycle behavior.",
  "frontend/src/hooks/useQueries.ts": "Implements React Query hooks for fetching and mutating user profiles, activity entries, patterns, habits, and programs through the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables for light/dark themes with a warm neutral color palette.",
  "frontend/src/main.tsx": "Bootstraps the React app by wrapping it with React Query and Internet Identity providers.",
  "frontend/src/patterns/summarizePatterns.ts": "Summarizes Pattern objects by counting types, averaging confidence, and extracting top types and common snippets.",
  "frontend/src/program/generateProgram.ts": "Generates a 30‑day Program based on detected patterns, habit categories, and optional insight signals to select relevant habits and explanations.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from the hash for routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, shadows, animations, and plugin integrations for the frontend.",
  "project_state.json": "Defines the project’s current state, goals, requirements, known issues, and image update instructions for the self‑improvement app MVP."
}