{
  "backend/main.mo": "Main Motoko canister implementing user profiles, habit library, activity entries, patterns, programs, and access control with storage mixins.",
  "feature_evidence.json": "JSON report mapping features to related files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Plain-text JSON-style mapping of frontend file paths to descriptive summaries.",
  "frontend/index.css": "Tailwind base style setup defining light/dark theme CSS variables and global styling.",
  "frontend/index.html": "Minimal HTML shell loading the React application root and main script.",
  "frontend/src/analysis/dashboardInsights.ts": "Utility module computing emotional trends, spending triggers, time distribution, and insight signatures from entries and patterns.",
  "frontend/src/analysis/detectPatterns.ts": "Scans text for predefined keyword categories, calculates confidence scores, and returns pattern matches with snippets.",
  "frontend/src/analysis/patternTypes.ts": "Defines pattern metadata including IDs, titles, and descriptions for different behavior categories.",
  "frontend/src/App.tsx": "Root React app handling authentication, error fallback for canister resolution, and switching between main views.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading states and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "A modal for entering and saving a user's name during initial profile setup with form validation.",
  "frontend/src/components/common/AccessDeniedScreen.tsx": "Displays a sign-in prompt when the user is unauthorized, featuring branding and a login button.",
  "frontend/src/components/common/CanisterResolutionFallback.tsx": "Shows troubleshooting guidance when the app cannot resolve a canister ID, with refresh and external link actions.",
  "frontend/src/components/entries/AddEntryView.tsx": "Form for adding a new activity entry with text, source selection, optional image upload, and submission handling.",
  "frontend/src/components/entries/EntriesListView.tsx": "Lists user entries with sorting, previews, and navigation to entry details or adding new entries.",
  "frontend/src/components/entries/EntryDetailView.tsx": "Displays detailed activity entry info, loads and renders optional image attachments, and provides navigation and analysis actions.",
  "frontend/src/components/habits/HabitLibraryView.tsx": "Fetches or seeds a habit library and renders habits grouped by category inside an accordion UI.",
  "frontend/src/components/landing/LandingPage.tsx": "Renders the public landing page with hero content, login button, and a copyable live URL display.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout including header, navigation, content area, footer, and live URL copying.",
  "frontend/src/components/onboarding/OnboardingDialog.tsx": "Shows an onboarding dialog explaining app steps and capabilities with a dismiss action.",
  "frontend/src/components/patterns/insights/EmotionalTrendsSection.tsx": "Displays aggregated emotional trend percentages and overall balance, with fallback when no data exists.",
  "frontend/src/components/patterns/insights/MorningNightDistributionSection.tsx": "Shows time-of-day activity percentages with bars and highlights peak period, including a no-data fallback.",
  "frontend/src/components/patterns/insights/SpendingTriggersSection.tsx": "Summarizes spending triggers with totals, averages, trend direction, and peak day, plus an empty state.",
  "frontend/src/components/patterns/PatternsDashboardView.tsx": "Loads patterns and entries, computes insights, and displays a dashboard with summaries and analytic sections.",
  "frontend/src/components/patterns/RunAnalysisButton.tsx": "Button that runs detectPatterns on entry text, saves patterns via mutation, and shows loading and toast messages.",
  "frontend/src/components/program/ProgramDayDetail.tsx": "Renders details for a specific program day including task info, rationale, reflection, and user check‑in data.",
  "frontend/src/components/program/ProgramView.tsx": "Manages program generation, automatic updates based on insight changes, and displays day details or overview.",
  "frontend/src/components/today/ProgressSummary.tsx": "Displays a 30‑day program’s completed days, current streak, and average mood using check‑ins.",
  "frontend/src/components/today/TodayCheckInView.tsx": "Renders the daily check‑in form, loads existing entries, and submits updates while showing progress and program state.",
  "frontend/src/data/habitLibrary.ts": "Defines a static library of habit templates grouped by category with metadata like duration and difficulty.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login, and identity persistence using DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls in React Query hooks for profiles, activity entries, patterns, habits, and programs with mutation helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers and loads global styles.",
  "frontend/src/patterns/summarizePatterns.ts": "Computes summary statistics for recent behavioral patterns, including counts, confidence averages, and snippet aggregation.",
  "frontend/src/program/generateProgram.ts": "Generates a 30‑day habit program by ranking categories from patterns and insights, then assigning habits with contextual explanations.",
  "frontend/src/utils/liveUrl.ts": "Builds the canonical live URL based on host rules and provides a helper to copy it to the clipboard.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, persisting, and clearing URL parameters across query strings, hash routes, and session storage.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with custom colors, fonts, shadows, breakpoints, and animations.",
  "project_state.json": "Stores project metadata, known issues, and deployment‑related feature requirements for resolving live URL errors."
}