{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix frontend initialization to prevent “canister id not resolved” on live load and surface the verified icp0.io link",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Prevent the app from initializing backend/actor-dependent logic before authentication and add a user-visible fallback when canister resolution fails in a fresh session.",
      "acceptanceCriteria": [
        "After redeploy, the app is reachable at the live URL without displaying “canister id not resolved”.",
        "Verification is done in an incognito/private window and after a hard refresh to avoid cached routing artifacts."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor the top-level App to avoid running actor/profile queries during the unauthenticated landing experience (e.g., split into authenticated vs unauthenticated subtrees so the landing page never triggers backend config resolution). Also wire a lightweight runtime error fallback for canister-resolution/config errors so a fresh browser session does not surface an uncaught “canister id not resolved” screen."
        },
        {
          "path": "frontend/src/components/common/CanisterResolutionFallback.tsx",
          "operation": "create",
          "description": "Create a small, English-only fallback component that renders a friendly explanation and recovery steps (hard refresh, open in a new private window, ensure using the provided icp0.io link) when the app detects/catches canister resolution/config initialization errors."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Expose a single, exact icp0.io live URL in the UI and ensure the landing page loads correctly at that URL.",
      "acceptanceCriteria": [
        "A single, exact URL is produced for the user to open.",
        "Opening the provided URL loads the React landing page (unauthenticated experience) rather than a resolution error."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/liveUrl.ts",
          "operation": "create",
          "description": "Add a small utility that derives the canonical live URL from the current location (prefer icp0.io when applicable) and returns a single exact URL string suitable for display/copy."
        },
        {
          "path": "frontend/src/components/landing/LandingPage.tsx",
          "operation": "modify",
          "description": "Integrate the live-URL utility to display the exact icp0.io URL (with a copy-to-clipboard action) on the landing page, ensuring the unauthenticated experience can be verified by opening that one link."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Optionally mirror the same canonical icp0.io URL display in the authenticated layout footer/help area so the user can always retrieve the verified live link after redeploy."
        }
      ]
    }
  ]
}